#+BEGIN_EXPORT html
---
layout: page
title: The Origin and Evolution of Programming Languages
tagline: " and Getting Started with Python"
permalink: /cs/python-programming-language-intro.html
categories: [cs, software development, python]
tags: [cs, software development, python]
---
#+END_EXPORT
#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+PROPERTY: header-args :exports both
#+PROPERTY: header-args+ :results output pp
#+PROPERTY: header-args+ :eval no-export
#+PROPERTY: vizier-thread-id thread_NZcAE9JAYKhKc4uej7g5k6Dx
#+PROPERTY: vizier-assistant-id asst_9U8N72u9uVQesQNNjgOLJOu8
#+TOC: headlines 2

** Which category does Python belong to: procedural, functional, object-oriented, or declarative?
Provide, please a code examples in Org-babel format.

#+begin_src markdown
  Python is a multi-paradigm programming language, which means it
  supports multiple programming paradigms: procedural, object-oriented,
  functional, and to a lesser extent, declarative programming. Here are
  examples demonstrating each paradigm in Python:

  ,**1. Procedural Programming**

  ```org
  ,#+begin_src python
  # Procedural style code

  # Function definition
  def greet(name): print(f"Hello, {name}!")

  # Main procedure
  if __name__ == "__main__": greet("World") # Function call

      # Loop to print iterations
      for i in range(3):
          print(f"Iteration {i}")
#+end_src
```

**2. Object-Oriented Programming (OOP)**

```org
#+begin_src python
# Object-Oriented style code

# Class definition
class Animal:
    def __init__(self, name):
        self.name = name

    def speak(self):
        pass

# Subclass definition
class Dog(Animal):
    def speak(self):
        return "Woof!"

# Object instantiation
dog = Dog("Buddy")
print(dog.speak())
#+end_src

#+RESULTS:
: Woof!

```

**3. Functional Programming**

```org
#+begin_src python
# Functional style code

# Higher-order function
def apply_function(func, value):
    return func(value)

# Lambda function definition
increment = lambda x: x + 1

# Use of map and filter with lambda functions
numbers = [1, 2, 3, 4, 5]
squared = map(lambda x: x * x, numbers)
evens = filter(lambda x: x % 2 == 0, numbers)

print(list(squared))  # Output: [1, 4, 9, 16, 25]
print(list(evens))    # Output: [2, 4]
#+end_src
```

**4. Declarative Programming (Limited, using SQLAlchemy ORM)**

```org
#+begin_src python
# Declarative style code using SQLAlchemy ORM

from sqlalchemy import Column, Integer, String, create_engine
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker

# Declarative base class
Base = declarative_base()

# User class definition with SQLAlchemy ORM
class User(Base):
    __tablename__ = 'users'
    id = Column(Integer, primary_key=True)
    name = Column(String)

# Database engine creation
engine = create_engine('sqlite:///:memory:')
Base.metadata.create_all(engine)
Session = sessionmaker(bind=engine)
session = Session()

# Adding a new user declaratively
new_user = User(name='Alice')
session.add(new_user)
session.commit()

# Querying the user
user = session.query(User).first()
print(user.name)  # Output: Alice
#+end_src
```

**Summary:**
- **Procedural Programming:** Python can be used in a procedural
  style, where code is organized into functions and sequentially
  executed instructions.
- **Object-Oriented Programming (OOP):** Python supports OOP with
  classes and objects, encapsulation, inheritance, and polymorphism.
- **Functional Programming:** Python has first-class functions,
  supports higher-order functions, and provides constructs like `map`,
  `filter`, and lambdas, making it suitable for functional
  programming.
- **Declarative Programming (Limited):** Python support for
  declarative programming is more limited and typically achieved
  through specific libraries and frameworks, such as SQLAlchemy for
  ORM.

This flexibility allows developers to choose the most suitable
paradigm or mix and match paradigms to best suit the needs of their
application.  #+end_src

*** Object identity

Object identity refers to the unique integer value that identifies an
object. This identity is unique during the lifetime of the object and
remains constant throughout its lifetime. It can be thought of as the
object's address in memory.

~is~ operator compares the identity of two objects; the ~id()~
function returns an integer representing its identity.

#+begin_src python :results output
  a = 10
  b = 15
  print(id(a))
  print(id(b))
#+end_src

#+RESULTS:
: 10861480
: 10861640

#+begin_src python :results output
  a = [1, 2, 3]
  b = a
  c = [1, 2, 3]
  print(a is b)
  print(a is c)
  print(a == c)
#+end_src

#+RESULTS:
: True
: False
: True

Use ~is~ to check if two variables reference the same object;
Use == to check if two variables have the same value.

*** An object's type and value

An object’s type determines the operations that the object supports
and also defines the possible values for objects of that type.
~type()~ function returns an object’s type. Like its identity, an
object’s ‘type’ is also unchangeable.

#+begin_src python :results output
  x = 5
  print(type(x))
#+end_src

#+RESULTS:
: <class 'int'>

The ‘value’ of some objects can change. Objects whose value can change
are said to be /mutable/; objects whose value is unchangeable once
they are created are called /immutable/. Numbers, strings and tuples
are /immutable/, while dictionaries and lists are /mutable/.

Some objects contain references to other objects; these are called
/containers/. Examples of containers are tuples, lists and
dictionaries.

#+begin_src python :results output
  my_list = [
    "hello",
    42,
    3,56,
    [1, 2, 3],
    {'key': 'value'}
    ]
  print(my_list)
#+end_src

#+RESULTS:
: ['hello', 42, 3, 56, [1, 2, 3], {'key': 'value'}]

****  Numbers in Python

Python supports three types of numbers: /integers, floats and complex/
numbers. These types are used to represent numeric data in Python
programming.

- /Integers/ (int) are whole numbers, including negative numbers but
  not fractions. These represent numbers in an unlimited range.  The
  /Boolean/ (bool) type is a subtype of the integer type. These
  represent the truth values /False/ and /True/.
- /Float/ (float) are real numbers with a fractional part denoted by
  the decimal symbol or the scientific notation.
- /Complex/ (complex) store the real and imaginary parts as floats by
  default.

  Type Conversion:


- ~int()~ Function converts a string or float to an integer;

- ~float()~ Function converts a string or integer to a float;

- ~complex()~ Function converts a string or float to a complex number;

  Operations:

- /Arithmetic Operations/: Integers and floats support basic
  arithmetic operations like addition, subtraction, multiplication,
  and division;

- /Modulus/: The modulus operator (%) returns the remainder of the
  division operation;

- /Exponentiation/: The exponentiation operator (***) raises a number
  to a power;

- /Absolute Value/: The ~abs()~ function returns the absolute value of
  a number.

  Built-in Functions:

  - ~math~ module: provides functions like ~sqrt()~, ~exp()~ and
    ~pi()~ for mathematical operations;

    #+begin_src python :results output
      import math
      print(math.pi)
      print(math.e)
      print(math.exp(10))
    #+end_src

    #+RESULTS:
    : 3.141592653589793
    : 2.718281828459045
    : 22026.465794806718

  - ~max()~ and ~min()~ functions: return the maximum and minimum
    values of a set of numbers.

    #+begin_src python :results output
      numbers = [4, 12, 43.3, 19, 100]
      print("Minimum:", min(numbers))
      print("Maximum:", max(numbers))

    #+end_src

    #+RESULTS:
    : Minimum: 4
    : Maximum: 100



